{
  "trainingPrograms": {
    "image": "",
    "programs": [
      {
        "id": 1,
        "title": "NetSuite Fundamentals",
        "shortDescription": "Core concepts and navigation basics",
        "longDescription": "This comprehensive fundamentals program introduces you to the core concepts of NetSuite, covering essential navigation, basic configuration, and understanding the platform's architecture. Perfect for new users who want to build a solid foundation in NetSuite operations. You'll learn about dashboards, basic record management, user interface customization, and essential business processes. Our expert instructors will guide you through hands-on exercises to ensure practical understanding of the system."
      },
      {
        "id": 2,
        "title": "Advanced Modules",
        "shortDescription": "Financial management and reporting",
        "longDescription": "Dive deep into NetSuite's advanced modules with focus on financial management, advanced reporting, and complex business processes. This program covers general ledger management, accounts payable and receivable, budgeting and forecasting, financial reporting, and period-end procedures. You'll master advanced workflows, approval processes, and learn to create sophisticated financial reports. Ideal for finance professionals and power users who need to leverage NetSuite's full financial capabilities."
      },
      {
        "id": 3,
        "title": "Customization Training",
        "shortDescription": "SuiteScript and custom solutions",
        "longDescription": "Master NetSuite customization through comprehensive SuiteScript training and custom solution development. This advanced program covers SuiteScript 2.0, custom fields, forms, records, workflows, and restlets. You'll learn to build custom applications, integrate with external systems, and create sophisticated automation solutions. The course includes practical projects where you'll develop real-world customizations, user event scripts, scheduled scripts, and client scripts. Perfect for developers and technical consultants."
      },
      {
        "id": 4,
        "title": "Admin & Security",
        "shortDescription": "System administration and security",
        "longDescription": "Comprehensive system administration and security training for NetSuite environments. Learn user management, role configuration, permission settings, data security, and system maintenance. This program covers advanced topics including single sign-on (SSO), two-factor authentication, IP restrictions, audit trails, and compliance requirements. You'll master user provisioning, role-based access control, and security best practices. Essential for system administrators and IT professionals responsible for NetSuite security and governance."
      }
    ]
  },
  "trainingFeatures": [
    {
      "id": 1,
      "title": "Expert Instructors",
      "shortDescription": "Certified professionals with years of experience",
      "detailedDescription": "Our instructors are certified NetSuite professionals with extensive real-world experience across various industries. They bring practical insights from hundreds of implementations and possess deep technical knowledge of NetSuite's capabilities. Each instructor holds multiple NetSuite certifications and maintains up-to-date expertise through continuous learning and hands-on project experience.",
      "benefits": [
        "Industry-proven expertise with 10+ years of NetSuite experience",
        "Multiple NetSuite certifications (Administrator, Developer, Consultant)",
        "Real-world implementation experience across 500+ projects",
        "Specialized knowledge in various industry verticals",
        "Continuous learning and certification maintenance",
        "Direct access to NetSuite development team insights"
      ],
      "statistics": {
        "experience": "10+ Years Average",
        "certifications": "5+ Per Instructor",
        "projectsCompleted": "500+ Projects",
        "studentsSatisfaction": "98% Rating"
      }
    },
    {
      "id": 2,
      "title": "Hands-on Learning",
      "shortDescription": "Practical exercises with real-world scenarios",
      "detailedDescription": "Our training methodology emphasizes practical, hands-on learning through real-world scenarios and interactive exercises. Students work with live NetSuite environments, complete actual business processes, and solve real implementation challenges. This approach ensures immediate application of knowledge and builds confidence in using NetSuite effectively.",
      "benefits": [
        "Live NetSuite sandbox environments for each student",
        "Real business scenarios from actual client implementations",
        "Step-by-step guided exercises with immediate feedback",
        "Group projects that simulate workplace collaboration",
        "Access to sample data from various industries",
        "Practice with actual business workflows and processes"
      ],
      "statistics": {
        "practicalTime": "70% Hands-on",
        "scenarios": "50+ Real Cases",
        "environments": "Individual Sandboxes",
        "completionRate": "95% Success"
      }
    },
    {
      "id": 3,
      "title": "Flexible Scheduling",
      "shortDescription": "Multiple training formats to fit your needs",
      "detailedDescription": "We understand that every organization has unique scheduling requirements. Our flexible training options include multiple formats, timing options, and customization levels to accommodate your team's availability and learning preferences. Whether you need intensive workshops or extended learning programs, we have options that work for you.",
      "benefits": [
        "In-person, virtual, and hybrid training formats",
        "Weekend and evening session availability",
        "Self-paced online modules with instructor support",
        "Custom scheduling for corporate groups",
        "Recorded sessions for future reference",
        "Flexible start dates throughout the year"
      ],
      "statistics": {
        "formats": "3 Training Modes",
        "flexibility": "24/7 Online Access",
        "customization": "100% Adaptable",
        "availability": "Year-round"
      }
    },
    {
      "id": 4,
      "title": "Ongoing Support",
      "shortDescription": "Continuous assistance beyond training completion",
      "detailedDescription": "Our commitment to your success extends far beyond the classroom. We provide comprehensive ongoing support to ensure you can apply your new skills effectively in your work environment. This includes technical assistance, best practice guidance, and access to our expert community for continued learning and problem-solving.",
      "benefits": [
        "6 months of post-training email and phone support",
        "Access to exclusive online community and forums",
        "Monthly Q&A sessions with expert instructors",
        "Updated training materials as NetSuite evolves",
        "Priority access to advanced courses and webinars",
        "Direct line to implementation consultants for complex issues"
      ],
      "statistics": {
        "supportDuration": "6+ Months",
        "responseTime": "24 Hours",
        "community": "1000+ Members",
        "satisfaction": "97% Positive"
      }
    }
  ],
  "keyModules": [
    {
      "title": "System Architecture",
      "description": "Core system structure, data flow, and integration patterns",
      "duration": "8 hours"
    },
    {
      "title": "Financial Management",
      "description": "General ledger, budgeting, financial reporting, and analytics",
      "duration": "12 hours"
    },
    {
      "title": "E-commerce & CRM",
      "description": "Customer relationship management and e-commerce integration",
      "duration": "10 hours"
    },
    {
      "title": "Customization & Scripts",
      "description": "SuiteScript, custom fields, forms, and workflow automation",
      "duration": "16 hours"
    },
    {
      "title": "Advanced Reporting",
      "description": "Saved searches, dashboard creation, and analytics tools",
      "duration": "8 hours"
    },
    {
      "title": "User Administration",
      "description": "Role-based permissions, security setup, and user management",
      "duration": "6 hours"
    }
  ],
  "heroContent": {
    "title": "Professional Training Programs",
    "description": "Empower your team with comprehensive training solutions designed to enhance skills and drive success"
  },
  "programsSection": {
    "title": "Our Training Programs",
    "description": "Comprehensive training solutions designed to empower your team with the skills they need to excel",
    "image": "/images/training.jpg",
    "Professional_Badge": "Certified Training"
  },
  "keyModulesSection": {
    "title": "Key Training Modules",
    "description": "Comprehensive curriculum designed to master NetSuite from foundation to advanced implementation"
  },
  "whyChooseSection": {
    "title": "Why Choose Our Training?",
    "description": "We provide world-class training solutions that combine expertise, innovation, and practical application to ensure your team's success",
    "image": "/images/indleaders.jpg",
    "Professional_Badge": "Excellence Training"
  }
}
